// debugger;

// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// const arr1 = [1, 2, 3];
// const arr2 = [4, 5, 6];
// const arrConcat = arr1.concat(arr2);
// -----------------------------------------------------

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const arr1 = [1, 2, 3];
// const reveresedArr = arr1.reverse();
// -----------------------------------------------------

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// const arr1 = [1, 2, 3];
// const arr2 = arr1.push(4, 5, 6);
// -----------------------------------------------------

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.


// const arr1 = [1, 2, 3];
// const arr2 = arr1.unshift(4, 5, 6);

// -----------------------------------------------------

// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const arr = ['js', 'css', 'jq'];
// alert(arr[0]);

// -----------------------------------------------------

// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const arr = ['js', 'css', 'jq'];
// alert(arr[arr.length - 1]);
// -----------------------------------------------------

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].

// const arr = [1, 2, 3, 4, 5];
// const arr2 = arr.slice(0, 3);
// -----------------------------------------------------

//  8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].

// const arr = [1, 2, 3, 4, 5];
// const arr2 = arr.splice(3);
// console.log(arr2);
// -----------------------------------------------------
 
//9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// const arr2 = arr.splice(1, 2);
// console.log(arr);
// -----------------------------------------------------


// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].

// const arr = [1, 2, 3, 4, 5];
// const arr1 = arr.splice(1, 3);
// -----------------------------------------------------

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// -----------------------------------------------------

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.push('e');
// -----------------------------------------------------


// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

// let arr = [3, 4, 1, 2, 7];
// function compareNumeric(a, b) {
//     if (a > b) return 1;
//     if (a == b) return 0;
//     if (a < b) return -1;
//   }
// arr.sort(compareNumeric);
// -----------------------------------------------------


// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.

// let arr = [5, 6, 7, 8, 9];
// let sum = arr.reduce(function(a, b) {
//     return a + b;
//   });
// console.log(sum);
// -----------------------------------------------------

// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.

// let arr = [5, 6, 7, 8, 9];
// let arr1 = arr.map(function (x) {
//     return Math.pow(x, 2);
//   });
// console.log(arr1);
// -----------------------------------------------------

// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.

// let arr = [1,-3, 5, 6,-7, 8, 9,-11];
// let arr1 = arr.filter(function (x) {
//         return x < 0;
// });
// console.log(arr1);
// -----------------------------------------------------


// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.

// let arr = [1,-3, 5, 6,-7, 8, 9,-11];
// let arr1 = arr.filter(function (x) {
//         return x % 2 === 0;
// });
// console.log(arr1);
// -----------------------------------------------------

// 18. Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']. 
// Оставьте в нем только те строки, длина которых больше 5-ти символов.

// let arr = ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'];
// let arr1 = arr.filter(function (x) {
//             return x.length > 5;
//     });
// console.log(arr1);
// -----------------------------------------------------


// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. 
// Оставьте в нем только подмассивы.

// let arr = [1, 2, [3, 4], 5, [6, 7]];
// let arr1 = arr.filter(Array.isArray);
// console.log(arr1);
// -----------------------------------------------------


// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.

// let arr = [5,-3, 6,-5, 0,-7, 8, 9];
// let sumNeg = arr.reduce(function(accum, item) {
//     if (item < 0) { 
//         return accum + 1;
//     } else {
//     return accum;
// }

// },
// 0);

// console.log(sumNeg);